Tekla Open API Reference for Tekla Structures 2025
ArrowheadAttributes Constructor
 Creates a new default arrowhead attributes instance. The default values are ArrowheadPositions.None, ArrowheadTypes.FilledArrow, height 2.0 and width 1.0.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrowheadAttributes()
Public Sub New
See Also
Reference
ArrowheadAttributes Class
ArrowheadAttributes Overload
Tekla.Structures.Drawing Namespace